import random
#Task_1

# a = input("Какую Вы машину хотели бы приобрести? ")
# b = input("Какого цвета? ")
# c = input("С каким типом шин?(Весенний, Летний, Осенний, Зимний) ")
# print(f"Вы хотите приобрести машину {a}. {b} цвета. С {c} типом шин")

#Task_2
# a2 = input("На сколько мест Вы хотите забронировать стол в нашем ресторане? ")
# b2 = input("Какие блюда вы хотели бы заказать? ")
# c2 = input("На какое время?(XX:XX) ")
# print(f"Сделано! Вы забронировали {a2} мест на {c2}. Также мы приготовим вам: {b2}")

#Task_3

# a = "Pyt"
# print(a)
# a += "hon"
# print(a)

#Task_4

a = [26, 74, 85, 12, 1, 20]
print(random.choice(a))